// 상품 등록 시 필요한 카테고리 데이터 정의

export type PetType = 'dog' | 'cat';
export type MainCategoryKey = '사료' | '간식' | '용품' | '건강' | '의류';

export const CATEGORY_MAP: Record<
  PetType,
  Record<MainCategoryKey, string[]>
> = {
  dog: {
    사료: ['건식', '습식/화식', '건조', '기타'],
    간식: ['껌', '저키', '육포', '캔', '비스킷', '기타'],
    용품: ['위생/케어', '배변용품', '장난감', '외출/산책', '방석/매트', '기타'],
    건강: ['보조제', '건강검진', '피부/모질', '연고', '기타'],
    의류: ['액세서리', '민소매', '올인원', '아우터', '기타'],
  },
  cat: {
    사료: ['건식', '습식/화식', '건조', '기타'],
    간식: ['파우치', '스낵/트릿', '통살', '캔', '캣닢', '기타'],
    용품: ['모래', '배변용품', '장난감', '캣타워', '스크래쳐', '기타'],
    건강: ['보조제', '케어·검진', '기타'],
    의류: ['의류', '악세서리', '민소매', '기타'],
  },
};
